backend/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'arofah'
 LIMIT 1
---
    public function login()
    {
        $model = new UserModel();

        // 1. Tangkap inputan username & password dari Vue (Karena formatnya RAW JSON)
        $json = $this->request->getJSON();

        // Pake ?? '' biar aman dari error kalau seandainya data kosong
        $username = $json->username ?? '';
        $password = $json->password ?? '';

        // 2. Cari user berdasarkan username di database
        $user = $model->where('username', $username)->first();