backend/app/Controllers/Buku.php

    public function index()
    {
        $model = new BukuModel();

        // Join dengan tabel kategori biar nama_genre ikut tampil
        $data = $model->select('buku.*, kategori.nama_genre')
                      ->join('kategori', 'kategori.id = buku.id_kategori')
                      ->findAll();
---
SELECT `buku`.*, `kategori`.`nama_genre`
FROM `buku`
JOIN `kategori` ON `kategori`.`id` = `buku`.`id_kategori`

    public function create()
    {
        $model = new BukuModel();

        // Menangkap data yang dikirim dari VueJS / Postman
        $data = [
            'judul'             => $this->request->getVar('judul'),
            'id_kategori'       => $this->request->getVar('id_kategori'),
            'penulis'           => $this->request->getVar('penulis'),
            'penerbit'          => $this->request->getVar('penerbit'),
            'status_peminjaman' => $this->request->getVar('status_peminjaman')
        ];

        // Eksekusi insert ke database
        if ($model->insert($data)) {
---
INSERT INTO `buku` (`judul`, `id_kategori`, `penulis`, `penerbit`, `status_peminjaman`) VALUES ('Home Sweat Loan', '1', 'Almira Bastari', 'Gramedia', 'Tersedia')